#pragma once
#include "Vector.hpp"

// ============================================================
// =========================    希尔排序     ====================
// ============================================================
// 复杂度和步长序列有关
// 希尔、PS、pratt、塞奇维克序列（时间复杂度都不一样）
// 空间O(1), g,h-有序
// ============================================================
template <typename T> void shellSort(Rank lo, Rank hi){
	for (Rank d = (hi - lo) / 2; d > 0; d >>= 1) {
		for (Rank j = lo + d; j < hi; j++) {
			T x = _elem[j];
			Rank i = j;
			while (i >= lo + d && x < _elem[i - d]) {
				_elem[i] = _elem[i - d];
				i -= d;
			}
			_elem[i] = x;
		}
	}
}