#include "List.hpp"
// ============================================================
// ==============    插入排序 insert sort   ======================
// ============================================================
// 稳定
// 不归位
// 在线算法
// ============================================================

// 直接插入排序（使用列表实现，因此是线性查找）
// ----------------
// 时间复杂度
// 最好:O(n)
// 最差:O(n^2)
// 平均:O(n^2)
//-----------------
// 空间复杂度
// O(1)就地算法
// ---------------
// 稳定
// 不归位
// ===========================================================
template <typename T> void List<T>::insertionSort(ListNodePosi(T) p , int n){
	for(int r = 0; r<n; r++){
		inserA( search(p->data, r, p), p->data);
		p = p->succ;
		remove(p->pred);
	}
}

// 折半插入排序（使用向量实现，已完成排序的部分可以进行二分查找）
// ----------------
// 时间复杂度
// 最好:O(nlogn)，二分查找之后发现它就应该在这里
// 最差:O(n^2)
// 平均:O(n^2)
//-----------------
// 空间复杂度
// O(1)就地算法
// ---------------
// 稳定
// 不归位
// ===============================================
void binaryInsertionSort(int A[], int n){
    for(int i = 1; i < n; i++){
        int x = A[i];

        // 1. 二分查找插入位置
        int lo = 0, hi = i - 1;
        while(lo <= hi){
            int mid = (lo + hi) / 2;
            if(A[mid] > x) hi = mid - 1;
            else           lo = mid + 1;
        }
        // lo 即是插入位置

        // 2. 元素后移
        for(int j = i - 1; j >= lo; j--){
            A[j+1] = A[j];
        }

        // 3. 插入 x
        A[lo] = x;
    }
}
